In [481]:
import os
import pandas as pd
import csv

In [482]:
csv_path = os.path.join(os.getcwd(), 'Resources', 'purchase_data.csv')
purchase_df = pd.read_csv(csv_path)

In [483]:
purchase_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [484]:
clean_df = purchase_df.drop_duplicates("SN")

In [485]:
clean_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
773,773,Hala31,21,Male,19,"Pursuit, Cudgel of Necromancy",1.02
774,774,Jiskjask80,11,Male,92,Final Critic,4.19
775,775,Aethedru70,21,Female,60,Wolf,3.54
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19

In [486]:

total_players = pd.DataFrame(purchase_df, columns=["SN"])

In [487]:
total_players.drop_duplicates()

                SN
0          Lisim78
1      Lisovynya38
2       Ithergue48
3    Chamassasya86
4        Iskosia90
..             ...
773         Hala31
774     Jiskjask80
775     Aethedru70
777     Yathecal72
778        Sisur91

[576 rows x 1 columns]

In [488]:
clean_total_players = total_players.drop_duplicates()

In [489]:
#Total number of players
total_players2 = len(clean_total_players)

In [490]:
#Number of Unique Items
unique_items = purchase_df["Item Name"].unique()

In [491]:
#Average Purchase Price
average_price = purchase_df['Price'].mean()

In [492]:
average_price

3.050987179487176

In [493]:
#Total Number of Purchases
total_purchases = purchase_df['Purchase ID'].unique()
total_purchases = len(total_purchases)

In [494]:
#Total Revenue
total_revenue = purchase_df['Price'].sum()

In [495]:
total_revenue

2379.77

In [496]:
unique_items = purchase_df["Item Name"].unique()

In [497]:
unique_items = len(unique_items)

In [498]:
#Make a summary Table Dummby!

In [499]:
purchasing_df = pd.DataFrame({"Number of Unique Items": unique_items, "Average Price": average_price, "Number of Purchases": total_purchases,"Total Revenue": total_revenue}, index=[0])

In [500]:
purchasing_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [501]:
gendered_players = pd.DataFrame(purchase_df, columns=[
                        "Gender", "SN"])

In [502]:

merge_df = pd.merge(clean_total_players, gendered_players, on="SN", how="left")

In [503]:
merge_df

              SN  Gender
0        Lisim78    Male
1        Lisim78    Male
2        Lisim78    Male
3    Lisovynya38    Male
4     Ithergue48    Male
..           ...     ...
775       Hala31    Male
776   Jiskjask80    Male
777   Aethedru70  Female
778   Yathecal72    Male
779      Sisur91    Male

[780 rows x 2 columns]

In [504]:
clean_merge_df = merge_df.drop_duplicates()

In [505]:
clean_merge_df

                SN  Gender
0          Lisim78    Male
3      Lisovynya38    Male
4       Ithergue48    Male
5    Chamassasya86    Male
6        Iskosia90    Male
..             ...     ...
775         Hala31    Male
776     Jiskjask80    Male
777     Aethedru70  Female
778     Yathecal72    Male
779        Sisur91    Male

[576 rows x 2 columns]

In [506]:
gender_demo_df = clean_merge_df["Gender"].value_counts()

In [507]:
gender_percent_df = gender_demo_df/total_players2

In [508]:
gender_percent_df

Male                     0.840278
Female                   0.140625
Other / Non-Disclosed    0.019097
Name: Gender, dtype: float64

In [509]:
gender_demo_final = pd.DataFrame({"Total Count": gender_demo_df, "Percentage of Players": gender_percent_df})

In [510]:
gender_demo_final["Percentage of Players"] = gender_demo_final["Percentage of Players"].map("{:,.2%}".format)

In [511]:
gender_demo_final

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%

In [512]:
#Make a summary Table you Dummby!

In [513]:
#Purchase Count, Average Purcahse Price, Total Purchase Value, and Average Purchase Total Per Person
#Break Each value down by gender
by_person_df = purchase_df.groupby("Gender")

In [514]:
pur_count = by_person_df['Price']

In [515]:
pur_count

In [516]:
pur_count = pur_count.count()

In [517]:
pur_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [518]:
tot_per = by_person_df['Gender', 'SN', 'Price']

<ipython-input-518-51d0b62b4cc8>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  tot_per = by_person_df['Gender', 'SN', 'Price']

In [519]:
tot_per = tot_per.sum()

In [520]:
tot_per

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

In [521]:
avg_tot_per = by_person_df["Price"].sum()

In [522]:
avg_tot_per

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [523]:
avg_pur_price = by_person_df['Gender', 'Price']

<ipython-input-523-f32ea52ae4a7>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  avg_pur_price = by_person_df['Gender', 'Price']

In [524]:
avg_pur_price.mean()

                          Price
Gender
Female                 3.203009
Male                   3.017853
Other / Non-Disclosed  3.346000

In [525]:
#Make a Summary Table you Dummby!
by_person_df =  by_person_df['Price'].agg({'mean', 'sum', 'count',})

In [526]:
by_person_df.columns=['Purchase Count', 'Total Purchase Value', 'Average Purchase Price']

In [527]:
by_person_df = pd.DataFrame(by_person_df)

In [528]:
by_person_df["Average Purchase Total Per Person"] = (avg_tot_per / clean_merge_df["Gender"].value_counts())

In [529]:
by_person_df

,Purchase Count,Total Purchase Value,Average Purchase Price,Average Purchase Total Per Person
Gender,,,,
Female,113,361.94,3.203009,4.468395
Male,652,1967.64,3.017853,4.065372
Other / Non-Disclosed,15,50.19,3.346000,4.562727

In [530]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]
group_names = ['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+']

Purchase ID    576
SN             576
Age            576
Gender         576
Item ID        576
Item Name      576
Price          576
dtype: int64

In [531]:
#Break Values Down into bins of 4 year
clean_df['Ages'] = pd.cut(clean_df['Age'], bins,labels=group_names, include_lowest=False)

<ipython-input-531-b7cd9d331da9>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  clean_df['Ages'] = pd.cut(clean_df['Age'], bins,labels=group_names, include_lowest=False)

In [532]:
clean_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Ages
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
773,773,Hala31,21,Male,19,"Pursuit, Cudgel of Necromancy",1.02,20-24
774,774,Jiskjask80,11,Male,92,Final Critic,4.19,10-14
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10

In [533]:
age_group_df = clean_df.groupby('Ages').count()

In [534]:
age_group_df = pd.DataFrame(age_group_df)

In [535]:
age_group_df

       Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Ages
<10             17   17   17      17       17         17     17
10-14           22   22   22      22       22         22     22
15-19          107  107  107     107      107        107    107
20-24          258  258  258     258      258        258    258
25-29           77   77   77      77       77         77     77
30-34           52   52   52      52       52         52     52
35-39           31   31   31      31       31         31     31
40+             12   12   12      12       12         12     12

In [536]:
age_group_df = age_group_df.rename(columns={'SN': 'Total Players'})

In [537]:
age_group_df2 = age_group_df.drop(columns=["Gender", 'Purchase ID', 'Item ID', 'Item Name', 'Price', 'Age'])

In [538]:
age_group_df2['Percentage of Players'] = (age_group_df2['Total Players']/576)

In [539]:
age_group_df2

       Total Players  Percentage of Players
Ages
<10               17               0.029514
10-14             22               0.038194
15-19            107               0.185764
20-24            258               0.447917
25-29             77               0.133681
30-34             52               0.090278
35-39             31               0.053819
40+               12               0.020833

In [540]:
purchase_df['Ages'] = pd.cut(purchase_df['Age'], bins,labels=group_names, include_lowest=False)

In [541]:
age_sum_df = purchase_df.groupby(['Ages']).sum()['Price']

In [542]:
age_sum_df

Ages
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [543]:
age_mean_df = purchase_df.groupby(['Ages']).mean()['Price']

In [544]:
age_mean_df

Ages
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [545]:
age_count_df = purchase_df.groupby(['Ages']).count()['Price']

In [546]:
age_count_df

Ages
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Price, dtype: int64

In [547]:
age_demo_df = pd.merge(age_sum_df, age_mean_df, on='Ages', how='outer')

In [548]:
age_demo_df['Purchase Count'] = age_count_df

In [549]:
age_demo_df

       Price_x   Price_y  Purchase Count
Ages
<10      77.13  3.353478              23
10-14    82.78  2.956429              28
15-19   412.89  3.035956             136
20-24  1114.06  3.052219             365
25-29   293.00  2.900990             101
30-34   214.00  2.931507              73
35-39   147.67  3.601707              41
40+      38.24  2.941538              13

In [550]:
age_demo_df = age_demo_df.rename(columns={"Price_x": "Total Purchase Value", "Price_y": "Average Purcahse Price"})

In [551]:
age_demo_df

       Total Purchase Value  Average Purcahse Price  Purchase Count
Ages
<10                   77.13                3.353478              23
10-14                 82.78                2.956429              28
15-19                412.89                3.035956             136
20-24               1114.06                3.052219             365
25-29                293.00                2.900990             101
30-34                214.00                2.931507              73
35-39                147.67                3.601707              41
40+                   38.24                2.941538              13

In [552]:
for_avg_purch_df = purchase_df.groupby(["Ages"])

In [553]:
for_avg_purch_df

In [554]:
age_total_per_df = age_sum_df/age_group_df2['Total Players']

In [555]:
age_demo_df["Avg Total Purchase Per Person"] =  age_total_per_df

In [556]:
age_demo_df

,Total Purchase Value,Average Purcahse Price,Purchase Count,Avg Total Purchase Per Person
Ages,,,,
<10,77.13,3.353478,23,4.537059
10-14,82.78,2.956429,28,3.762727
15-19,412.89,3.035956,136,3.858785
20-24,1114.06,3.052219,365,4.318062
25-29,293.00,2.900990,101,3.805195
30-34,214.00,2.931507,73,4.115385
35-39,147.67,3.601707,41,4.763548
40+,38.24,2.941538,13,3.186667

In [557]:
#Purchase Count, Avg Purchase Price, Total Purchase Value in the Age bins

In [558]:
#Identify the whales by total purchase values then list(in a table)
#SN
#Purchase Count
#Average Purchase Price
#Total Purchase Value

In [559]:
#clean_df2 = purchase_df.drop_duplicates("SN")

In [560]:
#clean_df2

In [561]:
whale_sum_df = purchase_df.groupby(['SN']).sum()["Price"]

In [562]:
whale_sum_df.sort_values(ascending=False)

SN
Lisosia93      18.96
Idastidru52    15.45
Chamjask73     13.83
Iral74         13.62
Iskadarya95    13.10
               ...
Irilis75        1.02
Isurria36       1.02
Chanirra79      1.01
Aidai61         1.01
Alo38           1.00
Name: Price, Length: 576, dtype: float64

In [563]:
whale_mean_df = purchase_df.groupby(['SN']).mean()["Price"]

In [564]:
whale_mean_df.sort_values(ascending=False)

SN
Dyally87          4.99
Chanirrasta87     4.94
Yarithsurgue62    4.94
Ririp86           4.94
Lirtilsa71        4.94
                  ...
Qilalista41       1.02
Isurria36         1.02
Chanirra79        1.01
Aidai61           1.01
Alo38             1.00
Name: Price, Length: 576, dtype: float64

In [565]:
whale_count_df = purchase_df.groupby(['SN']).count()["Price"]

In [566]:
whale_count_df.sort_values(ascending=False)

SN
Lisosia93       5
Iral74          4
Idastidru52     4
Aina42          3
Iri67           3
               ..
Lisossala30     1
Lisossanya98    1
Lisotesta51     1
Lisovynya38     1
Adairialis76    1
Name: Price, Length: 576, dtype: int64

In [567]:
whale_df = pd.DataFrame({"Total Purchase Value": whale_sum_df, "Average Purchase Price": whale_mean_df, "Purchase Count": whale_count_df})

In [568]:
whale_df.sort_values(ascending=False, by="Purchase Count")

              Total Purchase Value  Average Purchase Price  Purchase Count
SN
Lisosia93                    18.96                3.792000               5
Iral74                       13.62                3.405000               4
Idastidru52                  15.45                3.862500               4
Asur53                        7.44                2.480000               3
Inguron55                    11.11                3.703333               3
...                            ...                     ...             ...
Hala31                        1.02                1.020000               1
Haisurra41                    4.40                4.400000               1
Hailaphos89                   3.81                3.810000               1
Haestyphos66                  1.97                1.970000               1
Iskosian40                    3.07                3.070000               1

[576 rows x 3 columns]

In [569]:
whale_df.sort_values(by="SN", ascending=False)

               Total Purchase Value  Average Purchase Price  Purchase Count
SN
Zontibe81                      8.03                2.676667               3
Zhisrisu83                     7.89                3.945000               2
Yoishirrala98                  4.58                4.580000               1
Yathedeu43                     6.02                3.010000               2
Yathecal82                     6.22                2.073333               3
...                             ...                     ...             ...
Aelaria33                      1.79                1.790000               1
Aela59                         4.32                4.320000               1
Aeda94                         4.91                4.910000               1
Adastirin33                    4.48                4.480000               1
Adairialis76                   2.28                2.280000               1

[576 rows x 3 columns]

In [570]:
#Identify the 5 Most Popular Items by Purchase Count, then list(in a table)
#Item ID
#Item Name
#Purchase Count
#Item Price
#Total Purchase Value

In [571]:
purchase_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Ages
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [572]:
item_df = purchase_df.loc[:, ["Item Name", "Item ID", "Price"]]

In [573]:
item_sum_df = item_df.groupby(["Item ID", "Item Name"]).sum()["Price"]

In [574]:
item_mean_df = item_df.groupby(["Item ID", "Item Name"]).mean()["Price"]

In [575]:
item_count_df = item_df.groupby(["Item ID", "Item Name"]).count()["Price"]

In [576]:
popular_items_df = pd.DataFrame({"Purchase Count": item_count_df, "Item Price": item_mean_df, "Total Purchase Value": item_sum_df})

In [577]:
pop_items_df2 = popular_items_df

In [578]:
popular_items_df.sort_values(ascending=False, by="Purchase Count")

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77
...,...,...,...,...
42,The Decapitator,1,1.750000,1.75
51,Endbringer,1,4.660000,4.66
118,"Ghost Reaver, Longsword of Magic",1,2.170000,2.17
104,Gladiator's Glaive,1,1.930000,1.93
91,Celeste,1,4.170000,4.17

In [579]:
#Identify the 5 Most Profitable Items by total purchase value, then list(in a table)
#Item Id
#Item Name
#Purchase Count
#Item Price
#Total Purchase Value

In [580]:
popular_items_df.sort_values(ascending=False, by="Total Purchase Value")

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80
...,...,...,...,...
28,"Flux, Destroyer of Due Diligence",2,1.060000,2.12
125,Whistling Mithril Warblade,2,1.000000,2.00
126,Exiled Mithril Longsword,1,2.000000,2.00
104,Gladiator's Glaive,1,1.930000,1.93
42,The Decapitator,1,1.750000,1.75